# 누락값이란?

In [1]:
from numpy import NaN, nan, NAN

In [2]:
NaN == 0

False

In [3]:
NaN == False

False

In [4]:
NaN == ''

False

In [5]:
NaN == NaN

False

비교할 값이 없는 것이니 상기의 사례에서 모두 False 출력

## 누락값 확인하는 방법: pd.isnull()

In [6]:
import pandas as pd

pd.isnull(NaN)

True

In [7]:
pd.notnull(NaN)

False

In [8]:
pd.notnull(42)

True

## 누락값이 생기는 이유

### 누락값이 있는 데이터 집합을 연결 -> 더 많은 누락값들이 생김

In [9]:
visited = pd.read_csv('DoitPandas_Resource/data/survey_visited.csv')
survey = pd.read_csv('DoitPandas_Resource/data/survey_survey.csv')
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [10]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [11]:
visited.merge(survey, left_on = 'ident', right_on = 'taken')

    ident   site       dated  taken person quant  reading
0     619   DR-1  1927-02-08    619   dyer   rad     9.82
1     619   DR-1  1927-02-08    619   dyer   sal     0.13
2     622   DR-1  1927-02-10    622   dyer   rad     7.80
3     622   DR-1  1927-02-10    622   dyer   sal     0.09
4     734   DR-3  1939-01-07    734     pb   rad     8.41
5     734   DR-3  1939-01-07    734   lake   sal     0.05
6     734   DR-3  1939-01-07    734     pb  temp   -21.50
7     735   DR-3  1930-01-12    735     pb   rad     7.22
8     735   DR-3  1930-01-12    735    NaN   sal     0.06
9     735   DR-3  1930-01-12    735    NaN  temp   -26.00
10    751   DR-3  1930-02-26    751     pb   rad     4.35
11    751   DR-3  1930-02-26    751     pb  temp   -18.50
12    751   DR-3  1930-02-26    751   lake   sal     0.10
13    752   DR-3         NaN    752   lake   rad     2.19
14    752   DR-3         NaN    752   lake   sal     0.09
15    752   DR-3         NaN    752   lake  temp   -16.00
16    752   DR-3         NaN    752    roe   sal    41.60
17    837  MSK-4  1932-01-14    837   lake   rad     1.46
18    837  MSK-4  1932-01-14    837   lake   sal     0.21
19    837  MSK-4  1932-01-14    837    roe   sal    22.50
20    844   DR-1  1932-03-22    844    roe   rad    11.25

### 데이터 입력을 잘못하는 경우

In [12]:
nan_included_series = pd.Series({'name': 'Yuna', 'sex': 'Female', 'job': 'Dancer', 'else': nan})
nan_included_series

name      Yuna
sex     Female
job     Dancer
else       NaN
dtype: object

In [13]:
nan_included_df = pd.DataFrame({
    'name': ['Yuna', 'Yujeong', 'Minyoung', 'Eunji'],
    'nickname': ['Danbaljwa', 'GGOBUGJWA', 'Mebojwa','Wangnunjwa'],
    'position': ['Subrapper', 'Center', 'Leadvocal', nan]
})
nan_included_df

       name    nickname   position
0      Yuna   Danbaljwa  Subrapper
1   Yujeong   GGOBUGJWA     Center
2  Minyoung     Mebojwa  Leadvocal
3     Eunji  Wangnunjwa        NaN

### 범위를 지정하여 데이터를 추출할 때 누락값이 생기는 경우

In [14]:
gapminder = pd.read_csv('DoitPandas_Resource/data/gapminder.tsv', sep = '\t')
gapminder

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [15]:
life_exp = gapminder.groupby(['year',])['lifeExp'].mean()
life_exp

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [16]:
life_exp.loc[range(2000, 2010),]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Int64Index([2000, 2001, 2003, 2004, 2005, 2006, 2008, 2009], dtype='int64', name='year'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

이런 방식으로는 더 이상 누락값 출력할 수 없음.

번외로 불린 추출을 통해 누락값 없이 원하는 행들을 추출할 수 있음

In [17]:
life_exp[life_exp.index>=2000]

year
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

## 누락값의 개수를 알아보는 방법

In [35]:
ebola = pd.read_csv('DoitPandas_Resource/data/country_timeseries.csv')

### count()매서드로 누락값이 아닌 값의 개수를 알아보기

In [36]:
ebola.count()

Date                   122
Day                    122
Cases_Guinea            93
Cases_Liberia           83
Cases_SierraLeone       87
Cases_Nigeria           38
Cases_Senegal           25
Cases_UnitedStates      18
Cases_Spain             16
Cases_Mali              12
Deaths_Guinea           92
Deaths_Liberia          81
Deaths_SierraLeone      87
Deaths_Nigeria          38
Deaths_Senegal          22
Deaths_UnitedStates     18
Deaths_Spain            16
Deaths_Mali             12
dtype: int64

### 전체 행의 개수에서 누락값이 아닌 행의 개수를 빼는 방법

In [37]:
ebola.shape[0] - ebola.count()

Date                     0
Day                      0
Cases_Guinea            29
Cases_Liberia           39
Cases_SierraLeone       35
Cases_Nigeria           84
Cases_Senegal           97
Cases_UnitedStates     104
Cases_Spain            106
Cases_Mali             110
Deaths_Guinea           30
Deaths_Liberia          41
Deaths_SierraLeone      35
Deaths_Nigeria          84
Deaths_Senegal         100
Deaths_UnitedStates    104
Deaths_Spain           106
Deaths_Mali            110
dtype: int64

### np.count_nonzero, isnull 매서드를 조합하는 방법

In [38]:
import numpy as np
np.count_nonzero(ebola.isnull())

1214

#### 특정 열에서 위의 방법으로 누락값 개수 구하기

In [39]:
np.count_nonzero(ebola['Cases_Guinea'].isnull())

29

### series.value_counts() 매서드

In [40]:
ebola.Cases_Guinea.value_counts(dropna = False)

NaN       29
86.0       3
495.0      2
112.0      2
390.0      2
          ..
235.0      1
231.0      1
226.0      1
224.0      1
2776.0     1
Name: Cases_Guinea, Length: 89, dtype: int64

위에서 보듯이 꼭 '데이터프레임[열이름]'으로 써야 하는 것은 아니고 '데이터 프레임.열이름'의 형태로 쓰이기도 한다!

value_counts()매서드의 dropna 인자값으로 False를 주는 것은 기본 인자값이 True인 경우 NaN의 빈도에 해당하는 값은 drop 해버리기 때문이다. 한 마디로 NaN의 빈도를 버리지 말고 표시해 주라는 의미인 것

## 누락값 처리하기

### 변경

#### .fillna(0)

In [41]:
ebola.fillna(0).iloc[0:5, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            0.0            10030.0
1    1/4/2015  288        2775.0            0.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286           0.0         8157.0                0.0
4  12/31/2014  284        2730.0         8115.0             9633.0

누락값을 모두 0으로 바꿔준다

#### .fillna(method = 'ffill')

In [42]:
ebola.fillna(method = 'ffill').iloc[0:10, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2769.0         8157.0             9722.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         8018.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7977.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

누락값이 발생하기 바로 이전 행에서의 같은 항목값으로 바꿔준다.

#### .fillna(method = 'bfill')

In [43]:
ebola.fillna(method = 'bfill').iloc[0:10, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0         8166.0            10030.0
1    1/4/2015  288        2775.0         8166.0             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2730.0         8157.0             9633.0
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         7977.0             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7862.0             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

마지막 값이 누락값인 경우 처리하지 못한다는 단점이 있음

#### .interpolate()

In [44]:
ebola.interpolate().iloc[0:10, 0:5]

         Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone
0    1/5/2015  289        2776.0            NaN            10030.0
1    1/4/2015  288        2775.0            NaN             9780.0
2    1/3/2015  287        2769.0         8166.0             9722.0
3    1/2/2015  286        2749.5         8157.0             9677.5
4  12/31/2014  284        2730.0         8115.0             9633.0
5  12/28/2014  281        2706.0         8018.0             9446.0
6  12/27/2014  280        2695.0         7997.5             9409.0
7  12/24/2014  277        2630.0         7977.0             9203.0
8  12/21/2014  273        2597.0         7919.5             9004.0
9  12/20/2014  272        2571.0         7862.0             8939.0

누락값의 앞 뒤 값 확인 후 그 두 값의 중간값으로 채워줌.

### 삭제하기

In [45]:
ebola.shape[0]

122

In [46]:
ebola.dropna()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
19,11/18/2014,241,2047.0,7082.0,6190.0,20.0,1.0,4.0,1.0,6.0,1214.0,2963.0,1267.0,8.0,0.0,1.0,0.0,6.0

In [47]:
ebola.dropna().shape[0]

1

굉장히 많은 값이 삭제됨. 자료 아까움. Last Resort!!!

## 누락값이 포함된 데이터 계산하기

In [49]:
ebola['Three_Cases_Sum'] = (ebola.Cases_Guinea + ebola.Cases_Liberia + ebola.Cases_SierraLeone)
ebola.loc[:, ['Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone', 'Three_Cases_Sum']]

     Cases_Guinea  Cases_Liberia  Cases_SierraLeone  Three_Cases_Sum
0          2776.0            NaN            10030.0              NaN
1          2775.0            NaN             9780.0              NaN
2          2769.0         8166.0             9722.0          20657.0
3             NaN         8157.0                NaN              NaN
4          2730.0         8115.0             9633.0          20478.0
..            ...            ...                ...              ...
117         103.0            8.0                6.0            117.0
118          86.0            NaN                NaN              NaN
119          86.0            NaN                NaN              NaN
120          86.0            NaN                NaN              NaN
121          49.0            NaN                NaN              NaN

[122 rows x 4 columns]

이렇게 그냥 합쳐서 새로운 열로 추가하면 한 열이라도 NaN일 경우 합은 무조건 NaN으로 남음.

### 'sum'열 값의 총 합 구하기

In [51]:
ebola.Three_Cases_Sum.sum(skipna = True)

197682.0

In [52]:
ebola.Three_Cases_Sum.sum(skipna = False)

nan

누락값을 스킵하도록 해야 sum의 결과값이 nan이 나오지 않음. 굳이 설정 안해도 skipna인자값은 True로 이미 설정되어 있긴 함